<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/title.png' width=500/></center>

# 1.데이터프레임 생성

## 1.1.데이터프레임 이해

### 1.1.1.데이터프레임이란


- Pandas 사용 목적이 데이터프레임을 사용하기 위한 목적으로 봐도 됩니다.
- 데이터를 처리, 조회, 분석하는 가장 효율적인 방법이 데이터프레임을 사용하는 것입니다.
- 일반적으로 접하게 되는 **테이블** 형태, **엑셀** 형태로 생각하시면 됩니다.
- 직접 만들 수 있으나 보통은 **csv 파일**, **엑셀 파일** 또는 DB에서 읽어옵니다.
- 다음은 자동차 연비에 대한 데이터 셋입니다.
- 이 데이터를 리스트나 딕셔너리 또는 배열 형태로는 저장할 수 없습니다.
- 데이터프레임 형태로 저장해 처리(변경또는 분석 등) 해야 합니다.

<img src='https://raw.githubusercontent.com/Jangrae/img/master/dataframe_sample.png' width=800 align="left"/>

### 1.1.2.데이터프레임 형태

- 데이터프레임은 인덱스(=행 이름)와 열 이름이 있고 없고에 따라 다른 형태를 갖습니다.
- 인덱스란 행을 특정지어 조회할 때, 열 이름은 열을 특정지어 조회할 때 사용하는 정보입니다.

<img src='https://raw.githubusercontent.com/Jangrae/img/master/dataframe05.png' width=450 align="left"/>

**1) 인덱스와 열 이름이 없는 형태**

- 우선 인덱스와 열 이름이 없는 데이터프레임 형태입니다.
- 열 이름이 없는 데이터프레임은 실무에서는 자주 볼 수 없을 것입니다.

<img src='https://raw.githubusercontent.com/Jangrae/img/master/dataframe01.png' width=380 align="left"/>

**2) 열 이름을 지정한 형태**

- 열 이름만 지정한 데이터프레임 형태입니다.
- 특별히 인덱스를 지정할 필요가 없는 경우가 많으므로 자주 보게 되는 형태입니다.

<img src='https://raw.githubusercontent.com/Jangrae/img/master/dataframe02.png' width=380 align="left"/>

**3) 인덱스와 열 이름을 지정한 형태**

- 인덱스와 열 이름 모두를 지정한 데이터프레임 형태입니다.
- 주식 시세와 같은 날짜가 인덱스로 지정되는 경우가 많습니다.

<img src='https://raw.githubusercontent.com/Jangrae/img/master/dataframe03.png' width=350 align="left"/>

## 1.2.데이터프레임 직접 만들기

- **pd.DataFrame()** 함수를 사용해 데이터프레임을 직접 만들 수 있습니다.
- 대부분 리스트, 딕셔너리, Numpy 배열로부터 데이터프레임을 만듭니다.
- 데이터프레임을 만들기 위해서는 다음 세 가지를 위한 데이터가 필요합니다.
    - 데이터
    - 열 이름
    - 인덱스 이름
- 열 이름을 지정하지 않으면 **열 번호**에 기반한 정수(0, 1, 2...)가 열 이름이 됩니다.
- 인덱스 이름을 지정하지 않으면 **행 번호**에 기반한 정수(0, 1, 2...)가 인덱스 이름이 됩니다.
- 머신러닝 모델의 성능 정보 등을 데이터프레임 형태로 분석해야 할 경우가 있으니 잘 알아야 합니다.

### 1.2.1.라이브러리 불러오기

- 데이터프레임을 사용하기 위해서 pandas 라이브러리를 **pd** 별칭을 주어 불러옵니다.
- pd 대신 다른 별칭을 써도 되지만, 이미 일반적으로 사용하는 pd를 별칭으로 사용합니다.

In [3]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### 1.2.2.리스트로  만들기

- 인덱스를 지정하지 않으면 행 번호가 인덱스, 열 번호가 열 이름이 됩니다.

In [11]:
# 1차원 리스트 만들기
stock = [94500, 92100, 92200, 92300]

# 데이터프레임 만들기
df = pd.DataFrame(stock)

# 확인
df.head()

       0
0  94500
1  92100
2  92200
3  92300

In [13]:
# 2차원 리스트 만들기
stock = [[94500, 92100, 92200, 92300],
         [96500, 93200, 95900, 94300],
         [93400, 91900, 93400, 92100],
         [94200, 92100, 94100, 92400],
         [94500, 92500, 94300, 92600]]

# 데이터프레임 만들기
df =pd.DataFrame(stock)

# 확인
df.head()

       0      1      2      3
0  94500  92100  92200  92300
1  96500  93200  95900  94300
2  93400  91900  93400  92100
3  94200  92100  94100  92400
4  94500  92500  94300  92600

- 필요하면 인덱스와 열 이름을 별도로 지정할 수 있습니다.

In [17]:
# 리스트 만들기
stock = [[94500, 92100, 92200, 92300],
         [96500, 93200, 95900, 94300],
         [93400, 91900, 93400, 92100],
         [94200, 92100, 94100, 92400],
         [94500, 92500, 94300, 92600]]
dates = ['2019-02-15', '2019-02-16', '2019-02-17', '2019-02-18', '2019-02-19']
names = ['High', 'Low', 'Open', 'Close']

# 데이터프레임 만들기
df =pd.DataFrame(data = stock,index = dates, columns= names) # index column 을 명시해서 넣어줘야 한다 

# 확인
df.head()

             High    Low   Open  Close
2019-02-15  94500  92100  92200  92300
2019-02-16  96500  93200  95900  94300
2019-02-17  93400  91900  93400  92100
2019-02-18  94200  92100  94100  92400
2019-02-19  94500  92500  94300  92600

### 1.2.3.딕셔너리로 만들기

- 딕셔너리로 데이터프레임을 만들면 딕셔너리의 **키**가 **열 이름**이 됩니다.
- 인덱스를 지정하지 않으면 행 번호가 인덱스가 됩니다.

In [25]:
# 딕셔너리 만들기
cust = {'Name': ['Gildong', 'Sarang', 'Jiemae', 'Yeoin'],
        'Level': ['Gold', 'Bronze', 'Silver', 'Gold'],
        'Score': [56000, 23000, 44000, 52000]}

# 확인
cust

{'Name': ['Gildong', 'Sarang', 'Jiemae', 'Yeoin'],
 'Level': ['Gold', 'Bronze', 'Silver', 'Gold'],
 'Score': [56000, 23000, 44000, 52000]}

In [27]:
# 데이터프레임 만들기
df =  pd.DataFrame(cust)

# 확인
df.head()

      Name   Level  Score
0  Gildong    Gold  56000
1   Sarang  Bronze  23000
2   Jiemae  Silver  44000
3    Yeoin    Gold  52000

- 필요하면 인덱스를 별도로 지정할 수 있습니다.

In [30]:
# 딕셔너리 만들기
cust = {'Name': ['Gildong', 'Sarang', 'Jiemae', 'Yeoin'],
        'Level': ['Gold', 'Bronze', 'Silver', 'Gold'],
        'Score': [56000, 23000, 44000, 52000]}

# 데이터프레임 만들기(인덱스 지정함)
df = pd.DataFrame(cust , index = ['C01','C02','C03','C04'])

# 확인
df.head()

        Name   Level  Score
C01  Gildong    Gold  56000
C02   Sarang  Bronze  23000
C03   Jiemae  Silver  44000
C04    Yeoin    Gold  52000

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 아래 주어진 리스트들을 사용해 score 데이터프레임을 만들고 확인하세요.

In [32]:
# 리스트 만들기
list_score = [[80, 75, 100, 90, 80],
              [85, 70,  80, 95, 90],
              [75, 80,  85, 90, 90],
              [85, 65,  85, 75, 70],
              [70, 85,  90, 85, 95]]

# 인덱스: ['Gildong', 'Sarang', 'Jiemae', 'Yeoin', 'Woodong']
list_index = ['Gildong', 'Sarang', 'Jiemae', 'Yeoin', 'Woodong']

# 열이름: ['Korean', 'English', 'Math', 'Science', 'History']
list_col = ['Korean', 'English', 'Math', 'Science', 'History']

# 데이터프레임 만들기
df = pd.DataFrame(list_score , index = list_index, columns=list_col )

# 확인
df.head()

         Korean  English  Math  Science  History
Gildong      80       75   100       90       80
Sarang       85       70    80       95       90
Jiemae       75       80    85       90       90
Yeoin        85       65    85       75       70
Woodong      70       85    90       85       95

## 1.3.CSV파일 읽어오기

- 분석용 데이터는 대부분 파일에서 읽어 가져오니 잘 익혀야 할 기능입니다.
- **read_csv()** 함수를 사용해서 CSV 파일에서 데이터를 읽어옵니다.

**[주요옵션]**
- sep: 구분자 지정(기본값 = 콤마)
- header: 헤더가 될 행 번호 지정(기본값 = 0)
- index_col: 인덱스 열 지정(기본값 = False)
- names: 열 이름으로 사용할 문자열 리스트
- encoding: 인코딩 방식을 지정

※ 참고

한글이 포함된 파일을 읽을 때 다음과 같은 encoding 오류가 발생하면 encoding='CP949'로 지정

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xb1 in position 0: invalid start byte

**[pop_simple 데이터 셋 정보]**

- year: 연도
- household: 가구 수
- k_male: 한국인 남자
- k_female: 한국인 여자
- f_male: 외국인 남자
- f_female: 외국인 여자

In [89]:
# 데이터 읽어오기
path = 'https://raw.githubusercontent.com/Jangrae/csv/master/pop_simple.csv'
pop = pd.read_csv(path)

# 상위 10행만 확인
pop.head(10)

   year  household  k_male  k_female  f_male  f_female
0  1981        NaN    4160      4191     NaN       NaN
1  1982        NaN    4160      4191     NaN       NaN
2  1983     2116.0    4160      4191     NaN       NaN
3  1984     2246.0    4160      4191     NaN       NaN
4  1985     2338.0    4788      4838     7.0       6.0
5  1986     2428.0    4899      4888     7.0       5.0
6  1987     2518.0    5000      4979     6.0       5.0
7  1988     2658.0    5156      5120     5.0       5.0
8  1989     2817.0    5305      5261     6.0       5.0
9  1990     2820.0    5321      5282     5.0       4.0

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 아래 주어진 경로의 파일에서 데이터를 읽어와 데이터프레임 temp를 만들어 보세요.

- 파일 경로: 'https://raw.githubusercontent.com/Jangrae/csv/master/weather_simple.csv'

**[weather_simple 데이터 셋 정보]**

- month: 년월
- temp: 평균 기온
- max_temp: 평균 최고 기온
- ext_max_temp: 극점 최고 기온
- min_temp: 평균 최저 기온
- ext_min_temp: 극점 최저 기온

In [40]:
# 데이터 읽어오기

path = 'https://raw.githubusercontent.com/Jangrae/csv/master/weather_simple.csv'
temp = pd.read_csv(path)

# 상위 5개 확인
temp.head(5)

     month  temp  max_temp  ext_max_temp  min_temp  ext_min_temp
0  2005-01  -2.5       1.5           7.3      -6.2         -11.0
1  2005-02  -1.9       2.2          10.5      -5.5         -13.1
2  2005-03   4.1       8.8          17.6       0.2          -6.5
3  2005-04  13.2      18.1          29.8       8.9           4.1
4  2005-05  17.7      22.9          30.2      13.0           6.3

## 1.4.인덱스 다시 설정

- 일반 열을 인덱스 열로 설정하거나, 행 순서에 기반한 정수값 인덱스로 초기화 할 수 있습니다.

<img src='https://raw.githubusercontent.com/jangrae/img/master/set_reset_index.png' width=700 align="left"/>

**1) 일반 열을 인덱스로 지정**

- 파일을 불러올 때 **index_col** 옵션을 사용해 인덱스가 될 열을 선택할 수 있습니다.
- 파일을 불러온 후에 **set_index()** 메서드를 사용해 인덱스가 될 열을 설정할 수 있습니다.

In [91]:
# 기기존 열 중 하나를 인덱스로 설정
#pop = pop.set_index('year') # 변경된 내용을 반환받을 변수 지정

# 변경을 그대로 반영 
pop.set_index('year',inplace = True)
# 확인
pop.head(5)

      household  k_male  k_female  f_male  f_female
year
1981        NaN    4160      4191     NaN       NaN
1982        NaN    4160      4191     NaN       NaN
1983     2116.0    4160      4191     NaN       NaN
1984     2246.0    4160      4191     NaN       NaN
1985     2338.0    4788      4838     7.0       6.0

In [ ]:
pop=pop.set_index('year',inplace = True)#  inplace = True 하면 pop의 값을 변경하고 결과를 반환하지 않음

**2) 인덱스 이름 삭제**

- 인덱스 이름은 특별히 사용할 일이 없으므로 삭제합니다.

In [93]:
# 인덱스 이름 삭제
pop.index.name = None 

# 확인
pop.head()

      household  k_male  k_female  f_male  f_female
1981        NaN    4160      4191     NaN       NaN
1982        NaN    4160      4191     NaN       NaN
1983     2116.0    4160      4191     NaN       NaN
1984     2246.0    4160      4191     NaN       NaN
1985     2338.0    4788      4838     7.0       6.0

**3) 인덱스 초기화**

- **reset_index()** 메서드를 사용해 행 번호에 기반한 정수 값으로 인덱스를 초기화 할 수 있습니다.
- **drop=True**를 설정하면 기존 인덱스 열을 일반 열로 가져오지 않고 버립니다.(기본값=False)

<img src='https://raw.githubusercontent.com/jangrae/img/master/reset_index04.png' width=700 align="left"/>

In [95]:
# 인덱스 초기화
pop= pop.reset_index(drop = False)

# 확인
pop.head()

   index  household  k_male  k_female  f_male  f_female
0   1981        NaN    4160      4191     NaN       NaN
1   1982        NaN    4160      4191     NaN       NaN
2   1983     2116.0    4160      4191     NaN       NaN
3   1984     2246.0    4160      4191     NaN       NaN
4   1985     2338.0    4788      4838     7.0       6.0

- 기존 인덱스를 제거하지 않으면 'index' 라는 이름의 열이 되니 적절히 변경합니다.

In [101]:
# 열 이름 변경

pop.rename(columns={'index':'year'}, inplace =True) # index 컬럼을 year로 바꾸기 
# 확인
pop.head()

   year  household  k_male  k_female  f_male  f_female
0  1981        NaN    4160      4191     NaN       NaN
1  1982        NaN    4160      4191     NaN       NaN
2  1983     2116.0    4160      4191     NaN       NaN
3  1984     2246.0    4160      4191     NaN       NaN
4  1985     2338.0    4788      4838     7.0       6.0

<img src='https://raw.githubusercontent.com/jangrae/img/master/practice_01.png' width=120 align="left"/>

[문1] 아래 주어진 경로의 파일에서 데이터를 읽어와 데이터프레임 temp를 만들어 보세요.

- 파일 경로: 'https://raw.githubusercontent.com/Jangrae/csv/master/weather_simple.csv'

In [103]:
# 데이터 읽어오기

path = 'https://raw.githubusercontent.com/Jangrae/csv/master/weather_simple.csv'

temp = pd.read_csv(path)

# 상위 5개 확인
temp.head()

     month  temp  max_temp  ext_max_temp  min_temp  ext_min_temp
0  2005-01  -2.5       1.5           7.3      -6.2         -11.0
1  2005-02  -1.9       2.2          10.5      -5.5         -13.1
2  2005-03   4.1       8.8          17.6       0.2          -6.5
3  2005-04  13.2      18.1          29.8       8.9           4.1
4  2005-05  17.7      22.9          30.2      13.0           6.3

[문2] temp 데이터프레임 month 열을 인덱스로 지정하세요.

In [105]:
# month를 인덱스로 지정
temp = temp.set_index('month')
# 확인
temp.head()

         temp  max_temp  ext_max_temp  min_temp  ext_min_temp
month
2005-01  -2.5       1.5           7.3      -6.2         -11.0
2005-02  -1.9       2.2          10.5      -5.5         -13.1
2005-03   4.1       8.8          17.6       0.2          -6.5
2005-04  13.2      18.1          29.8       8.9           4.1
2005-05  17.7      22.9          30.2      13.0           6.3

[문3] 인덱스 이름을 삭제하세요.

In [107]:
# 인덱스 이름 삭제

temp.index.name = None
# 확인

temp.head()

         temp  max_temp  ext_max_temp  min_temp  ext_min_temp
2005-01  -2.5       1.5           7.3      -6.2         -11.0
2005-02  -1.9       2.2          10.5      -5.5         -13.1
2005-03   4.1       8.8          17.6       0.2          -6.5
2005-04  13.2      18.1          29.8       8.9           4.1
2005-05  17.7      22.9          30.2      13.0           6.3

[문4] 기존 인덱스를 유지하고 인덱스를 초기화 하세요.

In [109]:
# 기존 인덱스 유지하고 인덱스 초기화
temp.reset_index(inplace = True)

# 확인
temp.head()

     index  temp  max_temp  ext_max_temp  min_temp  ext_min_temp
0  2005-01  -2.5       1.5           7.3      -6.2         -11.0
1  2005-02  -1.9       2.2          10.5      -5.5         -13.1
2  2005-03   4.1       8.8          17.6       0.2          -6.5
3  2005-04  13.2      18.1          29.8       8.9           4.1
4  2005-05  17.7      22.9          30.2      13.0           6.3

[문5] 기존 인덱스 이름을 month로 변경하세요.

In [115]:
# 인덱스 이름 변경: index --> month

temp.rename(columns={'index':'month' },inplace = True)

# 확인
temp.head()

     month  temp  max_temp  ext_max_temp  min_temp  ext_min_temp
0  2005-01  -2.5       1.5           7.3      -6.2         -11.0
1  2005-02  -1.9       2.2          10.5      -5.5         -13.1
2  2005-03   4.1       8.8          17.6       0.2          -6.5
3  2005-04  13.2      18.1          29.8       8.9           4.1
4  2005-05  17.7      22.9          30.2      13.0           6.3